{
  "project": {
    "id": "price-checker-001",
    "title": "Price Checker",
    "short_description": "As a hardware design lead, I developed a smart price checker for retail that delivers instant product details (price, name, image, discounts) to customers. The cost-effective device is now actively used in large hypermarkets, integrating seamlessly without requiring store infrastructure changes.",
    "thumbnail": "images/price_1.png",
    "details": {
      "overview": "​As a hardware designer, I led the development of an innovative, cost-effective price checker specifically designed for retail environments. This device is tailored to enhance customer experience by providing immediate and accurate product information, including price, name, discount details, and product images, directly at the point of interest. The smart price checker is currently produced and utilized in large hypermarkets, demonstrating its effectiveness and reliability in real-world retail settings. Its deployment offers a seamless integration into existing store infrastructures without requiring additional investments.​",
      "goals": [
        "Achieve a 50% reduction in unit cost through design optimization for mass production.",
        "Enable plug-and-play compatibility with all major retail software systems for instant integration.",
        "Develop universal hardware and API standards to eliminate custom setups and accelerate onboarding."
      ],
      "key_features": [
        "Multi-language support via configurable fonts to serve diverse markets.",
        "Smart advertisement engine that suggests alternative products post-scan to promote savings.",
        "Cost-effective hardware design centered on ESP32 and a single 3.5\" LCD.",
        "Seamless, wireless communication for content updates and real-time price sync."
      ],
      "technologies": [
        "ESP32 MCU",
        "C / C++",
        "Over-the-air (OTA)",
        "LCD Graphic Library (TFT_eSPI)"
      ],
      "media": {
        "images": [
          "images/price_2.png",
          "images/price_3.png"
        ],
        "videos": [
          "videos/acu_demo.mp4"
        ]
      }
    },
    "timeline": {
      "start": "2021-02",
      "end": "2021-09",
      "milestones": [
        {
          "title": "PCB Design",
          "date": "2021-02",
          "description": "Created multi-layer board with Battery Charger"
        },
        {
          "title": "Graphical Design",
          "date": "2021-03",
          "description": "Write firmware to draw objects in LCD and design pages"
        },
        {
          "title": "Font and Language implementation",
          "date": "2021-04",
          "description": "Coding a word engine for languages like Farsi and Arabic"
        },
        {
          "title": "Server API",
          "date": "2021-06",
          "description": "Writing a protocol to get data and image of a product over HTTPS connection"
        },
        {
          "title": "Advertisement Page ",
          "date": "2021-07",
          "description": "Writing a code to show advertisement"
        },
        {
          "title": "OTA",
          "date": "2021-08",
          "description": "Add over-the-air capability "
        },
        {
          "title": "Final Test",
          "date": "2021-09",
          "description": "Test the product in a real supermarket"
        }
      ]
    },
    "links": {
      "github": "",
      "demo": "",
      "pdf_report": ""
    },
    "enhancements": {
      "challenge": "The original antenna control unit struggled with connection stability in harsh marine conditions (up to force 10 winds), used low-grade sensors that failed in high-vibration environments, and had monolithic firmware that was difficult to maintain and scale.",
      "solution": "We completely redesigned the system with industrial-grade sensors, implemented a 6-schedule PID loop with deterministic timing, added EKF-based sensor fusion for stability, and created a modular firmware architecture using FreeRTOS for better maintainability and scalability.",
      "role_responsibilities": [
        {
          "icon": "fas fa-microchip",
          "title": "Firmware Architecture",
          "description": "Designed modular firmware structure with FreeRTOS, implementing drivers, middleware, and application layers"
        },
        {
          "icon": "fas fa-pcb",
          "title": "PCB Design & Layout",
          "description": "Created multi-layer board with optimized routing, power isolation, and EMC/EMI improvements"
        },
        {
          "icon": "fas fa-calculator",
          "title": "Sensor Fusion Algorithm",
          "description": "Implemented Extended Kalman Filter for gyro + accelerometer fusion in high-vibration conditions"
        },
        {
          "icon": "fas fa-vial",
          "title": "System Testing",
          "description": "Conducted real-world testing in marine environments to validate performance under force 10 conditions"
        }
      ],
      "results": [
        {
          "value": "99.2%",
          "label": "Connection Stability"
        },
        {
          "value": "60%",
          "label": "Performance Improvement"
        },
        {
          "value": "Force 10",
          "label": "Weather Resistance"
        },
        {
          "value": "-40%",
          "label": "Power Consumption"
        }
      ]
    }
  }
}